kayscorrelation/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 323.15;

boundaryField
{
    frontAndBack
    {
        type            empty;//zeroGradient;
    }

    topAndBottom
    {
        type            zeroGradient;
    }

    hot
    {
        type            fixedValue;
        value           uniform 353.15; // 34.6 degC
    }

    cold
    {
        type            fixedValue;
        value           uniform 293.15; // 15 degC
    }
}

// ************************************************************************* //
