kayscorrelation/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type            empty;//compressible::alphatJayatillekeWallFunction;
       // Prt             0.85;
       // value           uniform 0;
    }
    topAndBottom
    {
        type	zeroGradient;
    }

    hot
    {
        type	zeroGradient;
    }

    cold
    {
        type	zeroGradient;
    }

}

// ************************************************************************* //
