kayscorrelation/0/epsilont
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilont;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 2 0 0 0];

internalField   uniform 1;

boundaryField
{
    frontAndBack
    {
        type            empty;//epsilonWallFunction;
        //value           uniform 0.01;
    }
    topAndBottom
    {
        type            epsilontLowReCWTManservisiWallFunction;
        value           uniform 2.1e-2;
    }
    hot
    {
        type            epsilontLowReCWTManservisiWallFunction;
        value           uniform 2.1e-2;
    }
    cold
    {
        type            epsilontLowReCWTManservisiWallFunction;
        value           uniform 2.1e-2;
    }
}


// ************************************************************************* //
