kayscorrelation/0/vorticityField
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticityField;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform (0 -0 0);

boundaryField
{
    topAndBottom
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    hot
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    cold
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
}


// ************************************************************************* //
