kayscorrelation/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    topAndBottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
304
(
29.6974
29.6974
29.6974
29.6974
29.6974
29.6974
29.6974
29.6974
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    hot
    {
        type            calculated;
        value           nonuniform List<scalar> 
152
(
29.5878
29.5878
29.5878
29.5878
29.5878
29.5878
29.5878
29.5878
...
)
;
    }
    cold
    {
        type            calculated;
        value           nonuniform List<scalar> 
152
(
29.807
29.807
29.807
29.807
29.807
29.807
29.807
29.807
...
)
;
    }
}


// ************************************************************************* //
