kayscorrelation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    topAndBottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          304;
        startFace       45904;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          46208;
        startFace       46208;
    }
    hot
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          152;
        startFace       92416;
    }
    cold
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          152;
        startFace       92568;
    }
)

// ************************************************************************* //
