kayscorrelation/system/FOvorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

vorticity1
{
    // Mandatory entries
    type            vorticity;
    libs            ("libfieldFunctionObjects.so");

    // Optional (inherited) entries
    field           U;
    result          vorticityField;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         100000;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    timeStep;
    writeInterval   500;
}


// ************************************************************************* //

