kayscorrelation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    ( 0     0     0)
    ( 6     0     0)
    ( 6     6     0)
    ( 0     6     0)
    ( 0     0     0.1)
    ( 6     0     0.1)
    ( 6     6     0.1)
    ( 0     6     0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (152 152 1) 
    simpleGrading 
     (
     (
         (0.5 0.5 10) // 50% geo, 50% cell, 1
         (0.5 0.5 0.1) // 50% geo, 50% cell, 0.1
     )        // x-direction   
    (
         (0.5 0.5 10) // 50% geo, 50% cell, 1
         (0.5 0.5 0.1) // 50% geo, 50% cell, 0.1
     )        // y-direction    
     1) 
);

boundary
(
    topAndBottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
        );
    }

    frontAndBack
    {
        type wall;
        faces
        (
            (4 5 6 7)
            (3 2 1 0)
        );
    }

    hot
    {
        type wall;
        faces
        (
            (6 5 1 2)
        );
    }

    cold
    {
        type wall;
        faces
        (
            (4 7 3 0)
        );
    }
);
// ************************************************************************* //
